[
    "Can you write an email to request a meeting with my manager?",
    "What should I cook tonight with chicken and rice?",
    "How can I improve my CV for a data science role?",
    "Can you summarise this article about climate change?",
    "What are some fun weekend activities in London?",
    "Can you translate this text into Spanish for me?",
    "What’s the best way to start learning Python?",
    "Can you recommend a good book on philosophy?",
    "How do I troubleshoot my Wi-Fi connection?",
    "Can you draft a birthday message for my friend?",
    "What are the steps to make homemade pasta?",
    "Can you help me come up with a name for my app?",
    "What should I pack for a week-long beach holiday?",
    "Can you explain quantum computing in simple terms?",
    "What are some quick exercises for a busy schedule?",
    "Can you recommend a film similar to *Inception*?",
    "What’s the weather forecast for this weekend?",
    "Can you generate a list of New Year’s resolutions?",
    "How can I reduce my carbon footprint at home?",
    "What are the main themes of *Pride and Prejudice*?",
    "Can you suggest some unique gift ideas for Christmas?",
    "How do I set up a Git repository?",
    "What’s the best way to learn a new language quickly?",
    "Can you help me draft a resignation letter?",
    "What should I write in a thank-you card?",
    "How do I bake a chocolate cake from scratch?",
    "Can you recommend a podcast about history?",
    "What’s a good itinerary for a day trip to Paris?",
    "Can you summarise the plot of *The Great Gatsby*?",
    "How do I set goals for the new year effectively?",
    "What are some strategies for improving mental health?",
    "Can you create a workout plan for beginners?",
    "What are the top 5 tourist attractions in Japan?",
    "How do I calculate my monthly budget?",
    "Can you explain the basics of blockchain technology?",
    "What’s the best way to organise my workspace?",
    "Can you write a poem about friendship?",
    "How do I fix a leaking tap?",
    "What’s the difference between machine learning and AI?",
    "Can you help me write a personal statement for university?",
    "What should I do if I lose my passport while travelling?",
    "How can I make my presentations more engaging?",
    "Can you recommend a good wine to pair with steak?",
    "What are some tips for starting a vegetable garden?",
    "How do I politely decline an invitation?",
    "Can you write a script for a short video about sustainability?",
    "What are the key points in this research paper?",
    "How do I balance work and personal life effectively?",
    "What are the best apps for learning a new skill?",
    "Can you write a limerick about cats?",
    "What are some creative ideas for a kid’s birthday party?",
    "How can I improve my photography skills?",
    "Can you write a formal letter to a government official?",
    "What’s the easiest way to make money online?",
    "How do I start a successful YouTube channel?",
    "Can you explain the concept of circular economy?",
    "What’s the process of applying for a UK visa?",
    "Can you recommend a science-fiction book for beginners?",
    "How do I repair a broken zipper?",
    "What’s the healthiest way to prepare vegetables?",
    "Can you provide a detailed travel guide to Bali?",
    "How do I create a professional LinkedIn profile?",
    "What are the signs of burnout, and how do I recover?",
    "Can you write a script for a short play about friendship?",
    "What’s the best way to invest in the stock market?",
    "How do I start meditating as a beginner?",
    "Can you suggest a playlist for a road trip?",
    "What’s the difference between an MLA and APA citation?",
    "How do I organise a surprise party for a friend?",
    "Can you create a daily schedule for better productivity?",
    "What are some healthy snack ideas for work?",
    "How do I edit photos to look more professional?",
    "Can you generate creative names for a startup?",
    "What are some fun team-building activities for work?",
    "How do I write a complaint email effectively?",
    "Can you recommend a movie for family night?",
    "How can I improve my writing skills?",
    "What are the key points of *1984* by George Orwell?",
    "Can you create a packing list for a hiking trip?",
    "What’s the best way to learn to play the guitar?",
    "How do I calculate the cost of a home loan?",
    "Can you suggest ideas for a romantic dinner?",
    "What’s the history of the Great Wall of China?",
    "How do I learn to draw as a complete beginner?",
    "What’s the easiest way to fold a fitted sheet?",
    "Can you create a list of motivational quotes?",
    "How do I choose a new laptop for work?",
    "What are some strategies to improve public speaking?",
    "Can you write a guide to hosting a virtual event?",
    "What’s the most efficient way to clean a house?",
    "Can you explain the basics of climate change?",
    "What’s the difference between a comet and an asteroid?",
    "How do I politely ask for a raise at work?"
  ]